# Working with Missing data in pandas

In [3]:
import pandas as pd
import numpy as np

We begin by defining a pandas dataframe that contains some cells with missing values. Note that pandas, in addition to allowing us to create dataframes from a variety of files, also supports explicit declaration.

In [5]:
incomplete_df = pd.DataFrame({'id': [1,2,3,2,2,3,1,1,1,2,4],
                              'type': ['one', 'one', 'two', 'three', 'two', 'three', 'one', 'two', 'one', 'three','one'],
                              'amount': [345,928,np.NAN,645,113,942,np.NAN,539,np.NAN,814,np.NAN] 
                             }, columns=['id','type','amount'])

Column 'amount' is the only one with missing values. Now we display the dataframe

In [6]:
#TODO: display the dataframe
incomplete_df.head(11)

    id   type  amount
0    1    one   345.0
1    2    one   928.0
2    3    two     NaN
3    2  three   645.0
4    2    two   113.0
5    3  three   942.0
6    1    one     NaN
7    1    two   539.0
8    1    one     NaN
9    2  three   814.0
10   4    one     NaN

Recall that summary statistics and arithmetic with missing data is natively supported by pandas. Let's define two series, both containing some missing values.

In [7]:
A = incomplete_df['amount']
B = pd.Series(data=[np.NAN,125,335,345,312,np.NAN,np.NAN,129,551,800,222])

In [8]:
#TODO: print the content of A
print(A)
print ('\n')

#TODO: print the content of B
print(B)

0     345.0
1     928.0
2       NaN
3     645.0
4     113.0
5     942.0
6       NaN
7     539.0
8       NaN
9     814.0
10      NaN
Name: amount, dtype: float64


0       NaN
1     125.0
2     335.0
3     345.0
4     312.0
5       NaN
6       NaN
7     129.0
8     551.0
9     800.0
10    222.0
dtype: float64

The mean is computed normally and missing values are ignored:

In [9]:
# TODO: Compute and print the mean value of A
np.mean(A)

618.0

Min, Max, STD and Variance all work even when data are missing:

In [10]:
# TDOD: Compute and display the min, max, standard deviation and variance of B
print('minimum: ', np.min(B))
print('maximum: ', np.max(B))
print('standard deviation: ', np.std(B))
print('variance: ', np.var(B))

minimum:  125.0
maximum:  800.0
standard deviation:  212.2498159598731
variance:  45049.984375

We can also perform element-wise arithmetic operations between series with missing data. Note that by definition the result of any operation that involves missing values is NaN.

In [11]:
# TODO: Perform element-wise addition between the values in A and B
print(A+B)

0        NaN
1     1053.0
2        NaN
3      990.0
4      425.0
5        NaN
6        NaN
7      668.0
8        NaN
9     1614.0
10       NaN
dtype: float64

### Filling missing values

Recall that pandas has a function that allows you to drop any rows in a dataframe (or elements in a series) that contain a missing value.

In [12]:
# TODO: Print the values of attribute A before removing the null values
print('A before removing null values: ', A)

# TODO: now, print the values of A but without the null values 
print('A after removing null values: ', A[A.notna()])

A before removing null values:  0     345.0
1     928.0
2       NaN
3     645.0
4     113.0
5     942.0
6       NaN
7     539.0
8       NaN
9     814.0
10      NaN
Name: amount, dtype: float64
A after removing null values:  0    345.0
1    928.0
3    645.0
4    113.0
5    942.0
7    539.0
9    814.0
Name: amount, dtype: float64

However, very often you may wish to fill in those missing values rather than simply dropping them. Of course, pandas also has that functionality. For example, we could fill missing values with a scalar number, as shown below.

In [13]:
# TODO: replace the missing value with -99
print(A.fillna(-99))

0     345.0
1     928.0
2     -99.0
3     645.0
4     113.0
5     942.0
6     -99.0
7     539.0
8     -99.0
9     814.0
10    -99.0
Name: amount, dtype: float64

That actually works with any data type.

In [14]:
# TODO: fill the missing values with the string 'unknown'
A.fillna('unknown')

0         345
1         928
2     unknown
3         645
4         113
5         942
6     unknown
7         539
8     unknown
9         814
10    unknown
Name: amount, dtype: object

As such, we can use this functionality to fill in the gaps with the average value computed across the non-missing values.

In [15]:
# TODO: replace the missing values with the average value of the non-missing values
A.fillna(A.mean())

0     345.0
1     928.0
2     618.0
3     645.0
4     113.0
5     942.0
6     618.0
7     539.0
8     618.0
9     814.0
10    618.0
Name: amount, dtype: float64

Even better, if we want to fill in the gaps with mean values of corresponding *id's* (recall our initial dataframe printed below), the following two lines of code perform that seemingly complex task.

In [16]:
incomplete_df

    id   type  amount
0    1    one   345.0
1    2    one   928.0
2    3    two     NaN
3    2  three   645.0
4    2    two   113.0
5    3  three   942.0
6    1    one     NaN
7    1    two   539.0
8    1    one     NaN
9    2  three   814.0
10   4    one     NaN

In [67]:
# Fill in gaps in the 'amount' column with means obtained from corresponding id's in the first column
# one: 
incomplete_df.loc[(incomplete_df['type'] == 'one') & (incomplete_df['amount'].isnull()), 'amount'] = incomplete_df[incomplete_df['type'] == 'one']['amount'].mean()

# two:
incomplete_df.loc[(incomplete_df['type'] == 'two') & (incomplete_df['amount'].isnull()), 'amount'] = incomplete_df[incomplete_df['type'] == 'two']['amount'].mean()

# three:
incomplete_df.loc[(incomplete_df['type'] == 'three') & (incomplete_df['amount'].isnull()), 'amount'] = incomplete_df[incomplete_df['type'] == 'three']['amount'].mean()

incomplete_df.groupby('id')

#TODO: display the dataframe. What do you see?
print(incomplete_df)

    id   type  amount
0    1    one   345.0
1    2    one   928.0
2    3    two   326.0
3    2  three   645.0
4    2    two   113.0
5    3  three   942.0
6    1    one   636.5
7    1    two   539.0
8    1    one   636.5
9    2  three   814.0
10   4    one   636.5

In [18]:
# TODO: If there is no corresponding id and the cell is still null, simply use the overall mean
# -

You can fill values forwards and backwards with the flags *pad* / *ffill* and *bfill* / *backfill*

In [19]:
# TODO: fill the missing values in B with the values in the previous records (no limit)
print (B)
print ('\n')    # line to separate the output
B.fillna(method = 'pad')

0       NaN
1     125.0
2     335.0
3     345.0
4     312.0
5       NaN
6       NaN
7     129.0
8     551.0
9     800.0
10    222.0
dtype: float64

0       NaN
1     125.0
2     335.0
3     345.0
4     312.0
5     312.0
6     312.0
7     129.0
8     551.0
9     800.0
10    222.0
dtype: float64

We can set a limit if we only want to replace consecutive gaps.

In [20]:
# TODO: fill the missing values in B with the value in the next record (the value of a record can be used in the next record only)
B.fillna(method = 'bfill', limit = 1)

0     125.0
1     125.0
2     335.0
3     345.0
4     312.0
5       NaN
6     129.0
7     129.0
8     551.0
9     800.0
10    222.0
dtype: float64

### Outlier detection

We can use the data pid.csv to practice on outlier detection

In [21]:
# TODO: read the csv file pid
pid = pd.read_csv('pid.csv')
pid

      A    B   C   D    E     F      G   H  Label
0     6  148  72  35    0  33.6  0.627  50      1
1     1   85  66  29    0  26.6  0.351  31      0
2     8  183  64   0    0  23.3  0.672  32      1
3     1   89  66  23   94  28.1  0.167  21      0
4     0  137  40  35  168  43.1  2.288  33      1
..   ..  ...  ..  ..  ...   ...    ...  ..    ...
763  10  101  76  48  180  32.9  0.171  63      0
764   2  122  70  27    0  36.8  0.340  27      0
765   5  121  72  23  112  26.2  0.245  30      0
766   1  126  60   0    0  30.1  0.349  47      1
767   1   93  70  31    0  30.4  0.315  23      0

[768 rows x 9 columns]

In [22]:
# TODO: for each column except the label column, compute the standard deviation of the columns
# report all the values that are at distance > 3 * std from the mean value as outliers.
pid_std = pid.loc[:, pid.columns != 'Label'].std()
print('Standard deviation: ','\n',pid_std)
print('\n')

pid_std = 3*pid_std
print('3 * standard deviation: ','\n',pid_std)
print('\n')

# mean values of the columns:
pid_mean = pid.loc[:, pid.columns != 'Label'].mean()
print('Mean: ','\n',pid_mean)

print('Values that are too big:','\n',pid[(pid.loc[:, pid.columns != 'Label']-pid_mean-pid_std)>0].dropna(how = 'all'))
print('\n')
print('Values that are too small:','\n',pid[(pid.loc[:, pid.columns != 'Label']-pid_mean+pid_std)<0].dropna(how = 'all'))

Standard deviation:
 A      3.369578
B     31.972618
C     19.355807
D     15.952218
E    115.244002
F      7.884160
G      0.331329
H     11.760232
dtype: float64


3 * standard deviation:
 A     10.108734
B     95.917855
C     58.067422
D     47.856653
E    345.732007
F     23.652481
G      0.993986
H     35.280695
dtype: float64


Mean:
 A      3.845052
B    120.894531
C     69.105469
D     20.536458
E     79.799479
F     31.992578
G      0.471876
H     33.240885
dtype: float64
Values that are too big:
         A   B   C     D      E     F      G     H  Label
4     NaN NaN NaN   NaN    NaN   NaN  2.288   NaN    NaN
8     NaN NaN NaN   NaN  543.0   NaN    NaN   NaN    NaN
13    NaN NaN NaN   NaN  846.0   NaN    NaN   NaN    NaN
45    NaN NaN NaN   NaN    NaN   NaN  1.893   NaN    NaN
58    NaN NaN NaN   NaN    NaN   NaN  1.781   NaN    NaN
88   15.0 NaN NaN   NaN    NaN   NaN    NaN   NaN    NaN
111   NaN NaN NaN   NaN  495.0   NaN    NaN   NaN    NaN
123   NaN NaN NaN   NaN    NaN   NaN    NaN  69.0    NaN
153   NaN NaN NaN   NaN  485.0   NaN    NaN   NaN    NaN
159  17.0 NaN NaN   NaN    NaN   NaN    NaN   NaN    NaN
177   NaN NaN NaN   NaN    NaN  67.1    NaN   NaN    NaN
186   NaN NaN NaN   NaN  495.0   NaN    NaN   NaN    NaN
220   NaN NaN NaN   NaN  478.0   NaN    NaN   NaN    NaN
228   NaN NaN NaN   NaN  744.0   NaN  2.329   NaN    NaN
247   NaN NaN NaN   NaN  680.0   NaN    NaN   NaN    NaN
286   NaN NaN NaN   NaN  545.0   NaN    NaN   NaN    NaN
298  14.0 NaN NaN   NaN    NaN   NaN    NaN   NaN    NaN
330   NaN NaN NaN   NaN    NaN   NaN  1.476   NaN    NaN
370   NaN NaN NaN   NaN  465.0   NaN  2.137   NaN    NaN
371   NaN NaN NaN   NaN    NaN   NaN  1.731   NaN    NaN
395   NaN NaN NaN   NaN    NaN   NaN  1.600   NaN    NaN
409   NaN NaN NaN   NaN  579.0   NaN    NaN   NaN    NaN
415   NaN NaN NaN   NaN  474.0   NaN    NaN   NaN    NaN
445   NaN NaN NaN   NaN    NaN  59.4  2.420   NaN    NaN
453   NaN NaN NaN   NaN    NaN   NaN    NaN  72.0    NaN
455  14.0 NaN NaN   NaN    NaN   NaN    NaN   NaN    NaN
459   NaN NaN NaN   NaN    NaN   NaN    NaN  81.0    NaN
486   NaN NaN NaN   NaN  480.0   NaN    NaN   NaN    NaN
579   NaN NaN NaN  99.0    NaN   NaN    NaN   NaN    NaN
584   NaN NaN NaN   NaN  600.0   NaN    NaN   NaN    NaN
593   NaN NaN NaN   NaN    NaN   NaN  1.699   NaN    NaN
621   NaN NaN NaN   NaN    NaN   NaN  1.698   NaN    NaN
645   NaN NaN NaN   NaN  440.0   NaN    NaN   NaN    NaN
655   NaN NaN NaN   NaN  540.0   NaN    NaN   NaN    NaN
666   NaN NaN NaN   NaN    NaN   NaN    NaN  70.0    NaN
673   NaN NaN NaN   NaN    NaN  57.3    NaN   NaN    NaN
684   NaN NaN NaN   NaN    NaN   NaN    NaN  69.0    NaN
695   NaN NaN NaN   NaN  480.0   NaN    NaN   NaN    NaN
753   NaN NaN NaN   NaN  510.0   NaN    NaN   NaN    NaN


Values that are too small:
       A    B    C   D   E    F   G   H  Label
7   NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
9   NaN  NaN  NaN NaN NaN  0.0 NaN NaN    NaN
15  NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
49  NaN  NaN  0.0 NaN NaN  0.0 NaN NaN    NaN
60  NaN  NaN  0.0 NaN NaN  0.0 NaN NaN    NaN
75  NaN  0.0  NaN NaN NaN  NaN NaN NaN    NaN
78  NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
81  NaN  NaN  0.0 NaN NaN  0.0 NaN NaN    NaN
145 NaN  NaN  NaN NaN NaN  0.0 NaN NaN    NaN
172 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
182 NaN  0.0  NaN NaN NaN  NaN NaN NaN    NaN
193 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
222 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
261 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
266 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
269 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
300 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
332 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
336 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
342 NaN  0.0  NaN NaN NaN  NaN NaN NaN    NaN
347 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
349 NaN  0.0  NaN NaN NaN  NaN NaN NaN    NaN
357 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
371 NaN  NaN  NaN NaN NaN  0.0 NaN NaN    NaN
426 NaN  NaN  0.0 NaN NaN  0.0 NaN NaN    NaN
430 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
435 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
453 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
468 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
484 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
494 NaN  NaN  0.0 NaN NaN  0.0 NaN NaN    NaN
502 NaN  0.0  NaN NaN NaN  NaN NaN NaN    NaN
522 NaN  NaN  0.0 NaN NaN  0.0 NaN NaN    NaN
533 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
535 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
589 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
601 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
604 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
619 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
643 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
684 NaN  NaN  NaN NaN NaN  0.0 NaN NaN    NaN
697 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
703 NaN  NaN  0.0 NaN NaN  NaN NaN NaN    NaN
706 NaN  NaN  0.0 NaN NaN  0.0 NaN NaN    NaN

# Data Transformation

We begin by defining a pandas dataframe that contains some cells with missing values. Note that pandas, in addition to allowing us to create dataframes from a variety of files, also supports explicit declaration.

In [23]:
df = pd.DataFrame(np.arange(5 * 4). reshape(5, 4))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

### Data Sampling

To select a random subset without replacement, one way is to slice off the first k elements of the array returned by permutation, where k is the desired subset size. Here, we use the 'take' method, which retrieves elements along a given axis at the given indices. Using this function, we slice off the first three elements:

In [25]:
# TODO: perform permutation over the index of the dataframe and take the first three records
df.take([0,1,2])

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

To generate a sample with replacement, we can draw random integers.

In [44]:
# TODO: draw three random integer values from the index values of the dataframe 
# (Note that the default index of the dataframe starts from 0)
rint = np.random.randint(4, size=3)
rint

array([1, 3, 1])

These random integers can be used as input for the 'take' method, which is then used to sample the data. Since the random integers consistuting the array may be repeated, the rows sampled by this method may also be repeated -- or, in other words, sampled with replacement.

In [55]:
# Extract the row with indexes drawn in the previous step
print('Method with the random integers from numpy: ')
print(df.take(rint))
print('\n')
# Better and easier to use: 
# You can also define the random seed, which is good for simulations
print('Method with df.sample() from pandas: ')
print(df.sample(n=3))

Method with the random integers from numpy:
    0   1   2   3
1   4   5   6   7
3  12  13  14  15
1   4   5   6   7


Method with df.sample() from pandas:
    0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15

### Data Normalization or Standardization

Aside from sampling data, we may also want to normalize or standardize our data.

In [58]:
# TODO: normalize the data in the df by dividing the values over the sum of the values in the dataframe
df / df.sum().sum()

          0         1         2         3
0  0.000000  0.005263  0.010526  0.015789
1  0.021053  0.026316  0.031579  0.036842
2  0.042105  0.047368  0.052632  0.057895
3  0.063158  0.068421  0.073684  0.078947
4  0.084211  0.089474  0.094737  0.100000

In [63]:
# TODO: normalize the data in the df by dividing the values over the average of the values in the dataframe
df / df.mean().mean()

          0         1         2         3
0  0.000000  0.105263  0.210526  0.315789
1  0.421053  0.526316  0.631579  0.736842
2  0.842105  0.947368  1.052632  1.157895
3  1.263158  1.368421  1.473684  1.578947
4  1.684211  1.789474  1.894737  2.000000

In [66]:
# TODO: normalize the data in the df by mapping the values to the interval [-5,5]
(df / 1.9) - 5

          0         1         2         3
0 -5.000000 -4.473684 -3.947368 -3.421053
1 -2.894737 -2.368421 -1.842105 -1.315789
2 -0.789474 -0.263158  0.263158  0.789474
3  1.315789  1.842105  2.368421  2.894737
4  3.421053  3.947368  4.473684  5.000000